# A191 Stock Factors 041-060

In [1]:
import dai
import pandas as pd
from a191_sql_base import get_a191_sql_base

In [2]:
sd = '2023-01-01'
ed = '2026-01-01'

## A191 Factor 041

Formula:

`(RANK(MAX(DELTA((VWAP), 3), 5))* -1)`

In [5]:
sql_alpha_041 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_max(m_delta((vwap), 3), 5))* -1) 
    AS alpha_a191_f0041
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_041), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0041
40543   2023-01-13  000001.SZ         -0.692355
40544   2023-01-13  000002.SZ         -0.098937
40545   2023-01-13  000004.SZ         -0.059076
40546   2023-01-13  000005.SZ         -0.317457
40547   2023-01-13  000006.SZ         -0.067253
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.856506
3858341 2025-12-26  688800.SH         -0.980221
3858345 2025-12-26  688819.SH         -0.699244
3858346 2025-12-26  688981.SH         -0.976149
3858347 2025-12-26  689009.SH         -0.816172

[3631695 rows x 3 columns]

## A191 Factor 042

Formula:

`((-1 * RANK(STD(HIGH, 10))) * CORR(HIGH, VOLUME, 10))`

In [6]:
sql_alpha_042 = f"""--sql
SELECT
    date,
    instrument,
    ((-1 * c_pct_rank(m_stddev(high, 10))) * m_corr(high, volume, 10)) 
    AS alpha_a191_f0042
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_042), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0042
50681   2023-01-17  000001.SZ          0.357371
50682   2023-01-17  000002.SZ         -0.514139
50683   2023-01-17  000004.SZ         -0.325480
50684   2023-01-17  000005.SZ         -0.162507
50685   2023-01-17  000006.SZ         -0.947189
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.404462
3858341 2025-12-26  688800.SH         -0.812838
3858345 2025-12-26  688819.SH         -0.262377
3858346 2025-12-26  688981.SH         -0.537401
3858347 2025-12-26  689009.SH         -0.121125

[3621099 rows x 3 columns]

## A191 Factor 043

Formula:

`SUM((CLOSE>DELAY(CLOSE,1)?VOLUME:(CLOSE<DELAY(CLOSE,1)?-VOLUME:0)),6)`

In [7]:
sql_alpha_043 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(close > m_lag(close, 1), volume,
             IF(close < m_lag(close, 1), -volume, 0)), 6) 
    AS alpha_a191_f0043
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_043), filters={'date': [sd, ed]}).df().dropna()

              date instrument alpha_a191_f0043
30405   2023-01-11  000001.SZ        347997173
30406   2023-01-11  000002.SZ         45033269
30407   2023-01-11  000004.SZ         -4307993
30408   2023-01-11  000005.SZ         -9062160
30409   2023-01-11  000006.SZ       -256271542
...            ...        ...              ...
3858341 2025-12-26  688800.SH         29886983
3858342 2025-12-26  688802.SH        -17465800
3858345 2025-12-26  688819.SH          9461080
3858346 2025-12-26  688981.SH         35447818
3858347 2025-12-26  689009.SH          5368378

[3642292 rows x 3 columns]

## A191 Factor 044

Formula:

`(TSRANK(DECAYLINEAR(CORR(((LOW )), MEAN(VOLUME,10), 7), 6),4) + TSRANK(DECAYLINEAR(DELTA((VWAP),3), 10), 15))`

In [8]:
sql_alpha_044 = f"""--sql
SELECT
    date,
    instrument,
    (m_rank(m_decay_linear(m_corr(((low)), m_avg(volume,10), 7), 6),4) +
     m_rank(m_decay_linear(m_delta((vwap),3), 10), 15))  
    AS alpha_a191_f0044
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_044), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0044
137030  2023-02-16  000001.SZ              14.0
137031  2023-02-16  000002.SZ              19.0
137032  2023-02-16  000004.SZ               5.0
137033  2023-02-16  000005.SZ              14.0
137034  2023-02-16  000006.SZ              13.0
...            ...        ...               ...
3858340 2025-12-26  688799.SH              10.0
3858341 2025-12-26  688800.SH              12.0
3858345 2025-12-26  688819.SH              12.0
3858346 2025-12-26  688981.SH              19.0
3858347 2025-12-26  689009.SH              12.0

[3531143 rows x 3 columns]

## A191 Factor 045

Formula:

`(RANK(DELTA((((CLOSE * 0.6) + (OPEN *0.4))), 1)) * RANK(CORR(VWAP, MEAN(VOLUME,150), 15)))`

In [9]:
sql_alpha_045 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_delta((((close * 0.6) + (open *0.4))), 1)) *
     c_pct_rank(m_corr(vwap, m_avg(volume,150), 15))) 
    AS alpha_a191_f0045
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_045), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0045
847459  2023-09-05  000001.SZ          0.006210
847460  2023-09-05  000002.SZ          0.000311
847462  2023-09-05  000005.SZ          0.068368
847463  2023-09-05  000006.SZ          0.001135
847465  2023-09-05  000008.SZ          0.229395
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.020149
3858341 2025-12-26  688800.SH          0.338712
3858345 2025-12-26  688819.SH          0.619274
3858346 2025-12-26  688981.SH          0.074867
3858347 2025-12-26  689009.SH          0.013543

[2812701 rows x 3 columns]

## A191 Factor 046

Formula:

`(MEAN(CLOSE,3)+MEAN(CLOSE,6)+MEAN(CLOSE,12)+MEAN(CLOSE,24))/(4*CLOSE)`

In [10]:
sql_alpha_046 = f"""--sql
SELECT
    date,
    instrument,
    (m_avg(close,3)+m_avg(close,6)+m_avg(close,12)+m_avg(close,24))/(4*close) 
    AS alpha_a191_f0046
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_046), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0046
121771  2023-02-13  000001.SZ          1.031544
121772  2023-02-13  000002.SZ          1.011773
121773  2023-02-13  000004.SZ          1.001968
121774  2023-02-13  000005.SZ          1.004554
121775  2023-02-13  000006.SZ          0.975713
...            ...        ...               ...
3858340 2025-12-26  688799.SH          1.012580
3858341 2025-12-26  688800.SH          0.939922
3858345 2025-12-26  688819.SH          0.975427
3858346 2025-12-26  688981.SH          0.973911
3858347 2025-12-26  689009.SH          1.021628

[3547007 rows x 3 columns]

## A191 Factor 047

Formula:

`SMA((TSMAX(HIGH,6)-CLOSE)/(TSMAX(HIGH,6)-TSMIN(LOW,6))*100,9,1)`

In [11]:
sql_alpha_047 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm((m_max(high,6)-close)/(m_max(high,6)-m_min(low,6))*100,9,1) 
    AS alpha_a191_f0047
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_047), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0047
30405   2023-01-11  000001.SZ         17.460317
30406   2023-01-11  000002.SZ         43.209877
30407   2023-01-11  000004.SZ         98.591549
30408   2023-01-11  000005.SZ         92.307692
30409   2023-01-11  000006.SZ         88.372093
...            ...        ...               ...
3858341 2025-12-26  688800.SH         45.342180
3858342 2025-12-26  688802.SH         84.140282
3858345 2025-12-26  688819.SH         45.805534
3858346 2025-12-26  688981.SH         37.957303
3858347 2025-12-26  689009.SH         46.669126

[3642292 rows x 3 columns]

## A191 Factor 048

Formula:

`(-1*((RANK(((SIGN((CLOSE -DELAY(CLOSE, 1))) + SIGN((DELAY(CLOSE, 1) -DELAY(CLOSE, 2)))) +SIGN((DELAY(CLOSE, 2) -DELAY(CLOSE, 3)))))) * SUM(VOLUME, 5)) / SUM(VOLUME, 20))`

In [12]:
sql_alpha_048 = f"""--sql
SELECT
    date,
    instrument,
    (-1*((c_pct_rank(((sign((close - m_lag(close, 1))) +
                       sign((m_lag(close, 1) - m_lag(close, 2)))) +
                       sign((m_lag(close, 2) - m_lag(close, 3)))))) *
        m_sum(volume, 5)) / m_sum(volume, 20)) 
    AS alpha_a191_f0048
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_048), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0048
101438  2023-02-07  000001.SZ         -0.087917
101439  2023-02-07  000002.SZ         -0.088406
101440  2023-02-07  000004.SZ         -0.124009
101441  2023-02-07  000005.SZ         -0.134738
101442  2023-02-07  000006.SZ         -0.056056
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.040210
3858341 2025-12-26  688800.SH         -0.155814
3858345 2025-12-26  688819.SH         -0.204787
3858346 2025-12-26  688981.SH         -0.054390
3858347 2025-12-26  689009.SH         -0.133039

[3568164 rows x 3 columns]

## A191 Factor 049

Formula:

`SUM(((HIGH+LOW)>=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12)/(SUM(((HIGH+LOW)>=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12)+SUM(((HIGH+LOW)<=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12))`

In [13]:
sql_alpha_049 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(
        IF((high+low)>=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
    ) /
    (m_sum(
        IF((high+low)>=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
     ) +
     m_sum(
        IF((high+low)<=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
     )) 
    AS alpha_a191_f0049
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_049), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0049
65895   2023-01-20  000001.SZ          0.145299
65896   2023-01-20  000002.SZ          0.462162
65897   2023-01-20  000004.SZ          0.553846
65898   2023-01-20  000005.SZ          0.512821
65899   2023-01-20  000006.SZ          0.870504
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.461312
3858341 2025-12-26  688800.SH          0.432719
3858345 2025-12-26  688819.SH          0.251135
3858346 2025-12-26  688981.SH          0.245227
3858347 2025-12-26  689009.SH          0.397590

[3605214 rows x 3 columns]

## A191 Factor 050

Formula:

`SUM(((HIGH+LOW)<=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12)/(SUM(((HIGH+LOW)<=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12)+SUM(((HIGH+LOW)>=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12))-SUM(((HIGH+LOW)>=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12)/(SUM(((HIGH+LOW)>=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12)+SUM(((HIGH+LOW)<=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12))`

In [14]:
sql_alpha_050 = f"""--sql
SELECT
    date,
    instrument,
    (m_sum(
        IF((high+low)<=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
     ) /
     (m_sum(
        IF((high+low)<=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
      ) +
      m_sum(
        IF((high+low)>=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
      ))
    -
     m_sum(
        IF((high+low)>=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
     ) /
     (m_sum(
        IF((high+low)>=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
      ) +
      m_sum(
        IF((high+low)<=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
      ))
    ) 
    AS alpha_a191_f0050
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_050), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0050
65895   2023-01-20  000001.SZ          0.709402
65896   2023-01-20  000002.SZ          0.075676
65897   2023-01-20  000004.SZ         -0.107692
65898   2023-01-20  000005.SZ         -0.025641
65899   2023-01-20  000006.SZ         -0.741007
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.077375
3858341 2025-12-26  688800.SH          0.134562
3858345 2025-12-26  688819.SH          0.497731
3858346 2025-12-26  688981.SH          0.509547
3858347 2025-12-26  689009.SH          0.204819

[3605214 rows x 3 columns]

## A191 Factor 051

Formula:

`SUM(((HIGH+LOW)<=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12)/(SUM(((HIGH+LOW)<=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12)+SUM(((HIGH+LOW)>=(DELAY(HIGH,1)+DELAY(LOW,1))?0:MAX(ABS(HIGH-DELAY(HIGH,1)),ABS(LOW-DELAY(LOW,1)))),12))`

In [15]:
sql_alpha_051 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(
        IF((high+low)<=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
    ) /
    (m_sum(
        IF((high+low)<=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
     ) +
     m_sum(
        IF((high+low)>=(m_lag(high,1)+m_lag(low,1)), 0,
           greatest(abs(high-m_lag(high,1)),abs(low-m_lag(low,1)))), 12
     )) 
    AS alpha_a191_f0051
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_051), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0051
65895   2023-01-20  000001.SZ          0.854701
65896   2023-01-20  000002.SZ          0.537838
65897   2023-01-20  000004.SZ          0.446154
65898   2023-01-20  000005.SZ          0.487179
65899   2023-01-20  000006.SZ          0.129496
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.538688
3858341 2025-12-26  688800.SH          0.567281
3858345 2025-12-26  688819.SH          0.748865
3858346 2025-12-26  688981.SH          0.754773
3858347 2025-12-26  689009.SH          0.602410

[3605214 rows x 3 columns]

## A191 Factor 052

Formula:

`SUM(MAX(0,HIGH-DELAY((HIGH+LOW+CLOSE)/3,1)),26)/SUM(MAX(0,DELAY((HIGH+LOW+CLOSE)/3,1)-LOW),26)*100`

In [16]:
sql_alpha_052 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(greatest(0,high-m_lag((high+low+close)/3,1)),26) /
    m_sum(greatest(0,m_lag((high+low+close)/3,1)-low),26) * 100 
    AS alpha_a191_f0052
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_052), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0052
131944  2023-02-15  000001.SZ         90.069139
131945  2023-02-15  000002.SZ         71.229176
131946  2023-02-15  000004.SZ        111.688312
131947  2023-02-15  000005.SZ         84.745763
131948  2023-02-15  000006.SZ         64.698795
...            ...        ...               ...
3858340 2025-12-26  688799.SH         96.795531
3858341 2025-12-26  688800.SH        146.088996
3858345 2025-12-26  688819.SH        113.215401
3858346 2025-12-26  688981.SH        127.902606
3858347 2025-12-26  689009.SH        125.446680

[3536431 rows x 3 columns]

## A191 Factor 053

Formula:

`COUNT(CLOSE>DELAY(CLOSE,1),12)/12*100`

In [17]:
sql_alpha_053 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(close > m_lag(close, 1), 1, 0), 12) / 12 * 100 
    AS alpha_a191_f0053
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_053), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0053
60821   2023-01-19  000001.SZ         58.333333
60822   2023-01-19  000002.SZ         50.000000
60823   2023-01-19  000004.SZ         50.000000
60824   2023-01-19  000005.SZ         33.333333
60825   2023-01-19  000006.SZ          8.333333
...            ...        ...               ...
3858340 2025-12-26  688799.SH         50.000000
3858341 2025-12-26  688800.SH         41.666667
3858345 2025-12-26  688819.SH         58.333333
3858346 2025-12-26  688981.SH         41.666667
3858347 2025-12-26  689009.SH         50.000000

[3610510 rows x 3 columns]

## A191 Factor 054

Formula:

`(-1 * RANK((STD(ABS(CLOSE -OPEN)) + (CLOSE -OPEN)) + CORR(CLOSE, OPEN,10)))`

In [18]:
sql_alpha_054 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * c_pct_rank((m_stddev(abs(close -open), 10) +
                      (close - open)) +
                     m_corr(close, open, 10))) 
    AS alpha_a191_f0054
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_054), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0054
50681   2023-01-17  000001.SZ         -0.765801
50682   2023-01-17  000002.SZ         -0.996932
50683   2023-01-17  000004.SZ         -0.265289
50684   2023-01-17  000005.SZ         -0.522193
50685   2023-01-17  000006.SZ         -0.926365
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.038014
3858341 2025-12-26  688800.SH         -0.022304
3858345 2025-12-26  688819.SH         -0.696276
3858346 2025-12-26  688981.SH         -0.808573
3858347 2025-12-26  689009.SH         -0.019783

[3621102 rows x 3 columns]

## A191 Factor 055

Formula:

`SUM(16*(CLOSE-DELAY(CLOSE,1)+(CLOSE-OPEN)/2+DELAY(CLOSE,1)-DELAY(OPEN,1))/((ABS(HIGH-DELAY(CLOSE,1))>ABS(LOW-DELAY(CLOSE,1))&ABS(HIGH-DELAY(CLOSE,1))>ABS(HIGH-DELAY(LOW,1))?ABS(HIGH-DELAY(CLOSE,1))+ABS(LOW-DELAY(CLOSE,1))/2+ABS(DELAY(CLOSE,1)-DELAY(OPEN,1))/4:(ABS(LOW-DELAY(CLOSE,1))>ABS(HIGH-DELAY(LOW,1))&ABS(LOW-DELAY(CLOSE,1))>ABS(HIGH-DELAY(CLOSE,1))?ABS(LOW-DELAY(CLOSE,1))+ABS(HIGH-DELAY(CLOSE,1))/2+ABS(DELAY(CLOSE,1)-DELAY(OPEN,1))/4:ABS(HIGH-DELAY(LOW,1))+ABS(DELAY(CLOSE,1)-DELAY(OPEN,1))/4)))*MAX(ABS(HIGH-DELAY(CLOSE,1)),ABS(LOW-DELAY(CLOSE,1))),20)`

In [19]:
sql_alpha_055 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(
        16*(close-m_lag(close,1)+(close-open)/2+m_lag(close,1)-m_lag(open,1)) /
        (IF((abs(high-m_lag(close,1))>abs(low-m_lag(close,1)) AND
             abs(high-m_lag(close,1))>abs(high-m_lag(low,1))),
            abs(high-m_lag(close,1))+abs(low-m_lag(close,1))/2+
            abs(m_lag(close,1)-m_lag(open,1))/4,
            IF((abs(low-m_lag(close,1))>abs(high-m_lag(low,1)) AND
                abs(low-m_lag(close,1))>abs(high-m_lag(close,1))),
               abs(low-m_lag(close,1))+abs(high-m_lag(close,1))/2+
               abs(m_lag(close,1)-m_lag(open,1))/4,
               abs(high-m_lag(low,1))+
               abs(m_lag(close,1)-m_lag(open,1))/4)
        )) *
        greatest(abs(high-m_lag(close,1)),abs(low-m_lag(close,1))),20
    ) 
    AS alpha_a191_f0055
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_055), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0055
106518  2023-02-08  000001.SZ      -2792.608457
106519  2023-02-08  000002.SZ      -7946.825886
106520  2023-02-08  000004.SZ        -16.184696
106521  2023-02-08  000005.SZ         -4.904844
106522  2023-02-08  000006.SZ       -863.659077
...            ...        ...               ...
3858340 2025-12-26  688799.SH        -45.107506
3858341 2025-12-26  688800.SH        631.406220
3858345 2025-12-26  688819.SH         25.262711
3858346 2025-12-26  688981.SH        256.072843
3858347 2025-12-26  689009.SH        -13.838688

[3562874 rows x 3 columns]

## A191 Factor 056

Formula:

`(RANK((OPEN -TSMIN(OPEN, 12))) < RANK((RANK(CORR(SUM(((HIGH + LOW) / 2), 19), SUM(MEAN(VOLUME,40), 19), 13))^5)))`

In [20]:
sql_alpha_056 = f"""--sql
SELECT
    date,
    instrument,
    IF((c_pct_rank((open - m_min(open, 12))) <
        c_pct_rank((c_pct_rank(m_corr(
            m_sum(((high + low) / 2), 19),
            m_sum(m_avg(volume,40), 19), 13))^5))), 1, 0) * -1 
    AS alpha_a191_f0056
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_056), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0056
5067    2023-01-04  000001.SZ               0.0
5068    2023-01-04  000002.SZ               0.0
5069    2023-01-04  000004.SZ               0.0
5070    2023-01-04  000005.SZ               0.0
5071    2023-01-04  000006.SZ               0.0
...            ...        ...               ...
3858343 2025-12-26  688805.SH               0.0
3858344 2025-12-26  688807.SH               0.0
3858345 2025-12-26  688819.SH               0.0
3858346 2025-12-26  688981.SH               0.0
3858347 2025-12-26  689009.SH               0.0

[3668803 rows x 3 columns]

## A191 Factor 057

Formula:

`SMA((CLOSE-TSMIN(LOW,9))/(TSMAX(HIGH,9)-TSMIN(LOW,9))*100,3,1)`

In [21]:
sql_alpha_057 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm((close-m_min(low,9))/(m_max(high,9)-m_min(low,9))*100,3,1) 
    AS alpha_a191_f0057
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_057), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0057
45612   2023-01-16  000001.SZ         87.878788
45613   2023-01-16  000002.SZ         38.888889
45614   2023-01-16  000004.SZ         41.333333
45615   2023-01-16  000005.SZ         23.076923
45616   2023-01-16  000006.SZ          1.904762
...            ...        ...               ...
3858340 2025-12-26  688799.SH         53.084791
3858341 2025-12-26  688800.SH         56.641688
3858345 2025-12-26  688819.SH         58.482581
3858346 2025-12-26  688981.SH         76.797064
3858347 2025-12-26  689009.SH         55.602641

[3626398 rows x 3 columns]

## A191 Factor 058

Formula:

`COUNT(CLOSE>DELAY(CLOSE,1),20)/20*100`

In [22]:
sql_alpha_058 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(close > m_lag(close, 1), 1, 0), 20) / 20 * 100 
    AS alpha_a191_f0058
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_058), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0058
101438  2023-02-07  000001.SZ              50.0
101439  2023-02-07  000002.SZ              45.0
101440  2023-02-07  000004.SZ              55.0
101441  2023-02-07  000005.SZ              35.0
101442  2023-02-07  000006.SZ              25.0
...            ...        ...               ...
3858340 2025-12-26  688799.SH              55.0
3858341 2025-12-26  688800.SH              55.0
3858345 2025-12-26  688819.SH              55.0
3858346 2025-12-26  688981.SH              40.0
3858347 2025-12-26  689009.SH              50.0

[3568164 rows x 3 columns]

## A191 Factor 059

Formula:

`SUM((CLOSE=DELAY(CLOSE,1)?0:CLOSE-(CLOSE>DELAY(CLOSE,1)?MIN(LOW,DELAY(CLOSE,1)):MAX(HIGH,DELAY(CLOSE,1)))),20)`

In [23]:
sql_alpha_059 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(
        IF(close=m_lag(close,1),0,
           close-(IF(close>m_lag(close,1),
                     least(low,m_lag(close,1)),
                     greatest(high,m_lag(close,1)))))
        ,20
    ) 
    AS alpha_a191_f0059
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_059), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0059
101438  2023-02-07  000001.SZ        -35.320225
101439  2023-02-07  000002.SZ       -273.061952
101440  2023-02-07  000004.SZ          2.682149
101441  2023-02-07  000005.SZ         -1.112112
101442  2023-02-07  000006.SZ        -47.116854
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.635510
3858341 2025-12-26  688800.SH         30.837552
3858345 2025-12-26  688819.SH          2.033952
3858346 2025-12-26  688981.SH          1.890000
3858347 2025-12-26  689009.SH          1.260567

[3568164 rows x 3 columns]

## A191 Factor 060

Formula:

`SUM(((CLOSE-LOW)-(HIGH-CLOSE))/(HIGH-LOW)*VOLUME,20)`

In [3]:
sql_alpha_060 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(((close-low)-(high-close))/(high-low)*volume,20) 
    AS alpha_a191_f0060
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_060), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0060
101438  2023-02-07  000001.SZ      1.227172e+08
101439  2023-02-07  000002.SZ      3.883866e+07
101440  2023-02-07  000004.SZ     -2.341125e+05
101441  2023-02-07  000005.SZ     -3.923925e+06
101442  2023-02-07  000006.SZ     -2.282422e+08
...            ...        ...               ...
3858340 2025-12-26  688799.SH      1.801150e+06
3858341 2025-12-26  688800.SH      3.107696e+07
3858345 2025-12-26  688819.SH      5.571594e+06
3858346 2025-12-26  688981.SH      4.442434e+07
3858347 2025-12-26  689009.SH     -1.652318e+06

[3499587 rows x 3 columns]